cf_billing/Documents/бестИзменениеЗначенийПостоянногоРасхода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестИзменениеЗначенийПостоянногоРасхода</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестТУРассчитываемыеПоПостоянномуРасходу</xr:Item>
				<xr:Item>InformationRegister.бестОбъемыПостоянногоРасхода</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПостоянныйРасходТУ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПостоянныйРасходОбъемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемБыл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Catalogs/бестОбъектыРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бестОбъектыРасчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НазначениеНП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестНазначениеНежилогоПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбъектовРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестГруппыОбъектовРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКатегорииПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодERPМКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКонв</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаружныйОбъемЗдания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Documents/бестИзменениеЗначенийПостоянногоРасхода/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Инициализировать данные документа
//
// Параметры:
//  ДокументСсылка			 - ДокументСсылка.бестИзменениеЗначенийПостоянногоРасхода 
//  ДополнительныеСвойства	 - Структура 
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
	ИнициализироватьИсходныеДанныеДокумента(Схема);
		
	ДобавитьТекстЗапросабестОбъемыПостоянногоРасхода(Схема, "бестОбъемыПостоянногоРасхода");
	ДобавитьТекстЗапросабестТУРассчитываемыеПоПостоянномуРасходу(Схема, "бестТУРассчитываемыеПоПостоянномуРасходу");
		
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос  						= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", 					ДокументСсылка);
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияДанныхДокумента

Процедура ИнициализироватьИсходныеДанныеДокумента(Схема)
	ПолучитьШапкуДокумента(Схема);
КонецПроцедуры

Процедура ПолучитьШапкуДокумента(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	Шапка.Дата КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.ОбъектРасчета КАК ОбъектРасчета,
	|	бестОбъектыРасчета.МКД КАК МКД
	|ПОМЕСТИТЬ РеквизитыДокумента
	|ИЗ
	|	Документ.бестИзменениеЗначенийПостоянногоРасхода КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО Шапка.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|ГДЕ
	|	Шапка.Ссылка В(&мДокументы)");	
КонецПроцедуры 

#КонецОбласти

#Область ТекстыЗапросов

Процедура ДобавитьТекстЗапросабестОбъемыПостоянногоРасхода(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Период КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.ОбъектРасчета КАК ОбъектРасчета,
	|	РеквизитыДокумента.МКД КАК МКД,
	|	бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходОбъемы.Месяц КАК Месяц,
	|	бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходОбъемы.Объем КАК Объем,
	|	бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.ТочкаУчета КАК ТочкаУчета,
	|	бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.Услуга КАК Услуга,
	|	бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.ТарифнаяЗона КАК ТарифнаяЗона
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменениеЗначенийПостоянногоРасхода.ПостоянныйРасходТУ КАК бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменениеЗначенийПостоянногоРасхода.ПостоянныйРасходОбъемы КАК бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходОбъемы
	|			ПО бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.Ссылка = бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходОбъемы.Ссылка
	|				И бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.IDСтроки = бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходОбъемы.IDСтроки
	|		ПО РеквизитыДокумента.Ссылка = бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.Ссылка
	|ГДЕ
	|	НЕ бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.Отключить";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестТУРассчитываемыеПоПостоянномуРасходу(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Период КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.ОбъектРасчета КАК ОбъектРасчета,
	|	РеквизитыДокумента.МКД КАК МКД,
	|	бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.ТочкаУчета КАК ТочкаУчета,
	|	бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.Услуга КАК Услуга,
	|	бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НЕ бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.Отключить КАК ПрименятьПостоянныйРасход
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменениеЗначенийПостоянногоРасхода.ПостоянныйРасходТУ КАК бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ
	|		ПО РеквизитыДокумента.Ссылка = бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
